["A Visitor to Sandahl (Troubadour Tales)","The Guernsey Literary and Potato Peel Pie Society","The Janissary Tree: A Novel (Investigator Yashim)","The Black Tulip: A Novel of War in Afghanistan","Reposition Yourself Reflections: Living a Life Without Limits","Aloft","American Eclipse: A Nation's Epic Race to Catch the Shadow of the Moon and Win the Glory of the World","Trials and Tribble-Ations (Star Trek Deep Space Nine)","The Rime of the Ancient Mariner and Other Poems","Cold Paradise (A Stone Barrington Novel)","Life Hacks: Any Procedure or Action That Solves a Problem, Simplifies a Task, Reduces Frustration, Etc. in One's Everyday Life","The Mystery of Case D. Luc (The Cul-de-Sac Kids #6) (Book 6)","The House of Mirth (Twentieth-Century Classics)","LEGO City: Catch That Crook!","QBQ! The Question Behind the Question: Practicing Personal Accountability at Work and in Life","In Seconds (Bulletproof)","Knitting Without Tears: Basic Techniques and Easy-to-Follow Directions for Garments to Fit All Sizes","The Taming of the Shrew (Dover Thrift Editions)","Behind Rebel Lines: The Incredible Story of Emma Edmonds, Civil War Spy","Stone Cold (Camel Club Series)","Revealers","The Greatest Man in the World: The Secret Life of Walter Mitty (Tale Blazers)","Spike Heels","Pee Wee Scouts: Cookies and Crutches","Summer in Eclipse Bay","Your First Sailboat : How to Find and Sail the Right Boat for You","The Errant Knight","Fancy Nancy: Nancy Clancy, Secret Admirer","The Mima Journals, Book 1: The Water is Wide","Major Pettigrew's Last Stand: A Novel","A Whole New Mind: Why Right-Brainers Will Rule the Future","When the White House Was Ours","Heidi Heckelbeck and the Secret Admirer","The Rummager's Handbook: Making the most of secondhand treasures","A Bright Shining Lie: John Paul Vann and America in Vietnam","Chew Volume 1: Tasters Choice","Nothing to Lose (Jack Reacher)","i before e (except after c): old-school ways to remember stuff (Blackboard Books)","Solutions: Enhancing Love, Sex, and Relationships","Eclipse (Twilight Sagas)","Praying Circles around Your Children","The Second Treatise of Government and A Letter Concerning Toleration (Dover Thrift Editions)","Michael Chiarello's Flavored Oils and Vinegars: 100 Recipes for Cooking with Infused Oils and Vinegars","Thirteen Reasons Why","The Poky Little Puppy (A Little Golden Book Classic)","Splashes of Joy in the Cesspools of Life","Cupcakes! Muffins & More (Taste of Home)","The Talented Clementine","Flyte (Septimus Heap, Book 2)","Aliens Ate My Homework (Rod Allbright and the Galactic Patrol)","Atonement: A Novel","Spiny Sea Star: A Tale of Seeing Stars","Proof of Life: A J. P. Beaumont Novel","Putt Like the Pros: Dave Pelz's Scientific Way to Improving Your Stroke, Reading Greens, and Lowering Your Score","Baby Proof: A Novel","Mall Mania (MathStart 2)","Lost in Yonkers (Drama, Plume)","I Hate Everyone...Starting with Me","Stone Cold (A Jesse Stone Novel)","The Yiddish Policemen's Union: A Novel (P.S.)","Janissaries","The Codicil","Inconstant Star","Deafening: A Novel","Maybe a Bear Ate It (A StoryPlay Book)","Sometimes I Like to Curl Up in a Ball","The Glorious Cause (The American Revolutionary War)","Simpler Times","Dawn and the Impossible Three (The Baby-sitters Club Graphic Novel #5): A Graphix Book (The Baby-Sitters Club Graphix)","Anne of Windy Poplars (Anne of Green Gables)","The 90% Reading Goal","City of Dark Magic: A Novel (City of Dark Magic Series)","The Rummager's Handbook: Finding, Buying, Cleaning, Fixing, Using, & Selling Secondhand Treasures","The Puzzler's Mansion: The Puzzling World of Winston Breen","Blindfold Game","How to Calculate Quickly: Full Course in Speed Arithmetic (Dover Books on Mathematics)","Mulch Ado About Nothing (Jane Jeffry Mysteries, No. 12)","My Weird School #18: Mrs. Yonkers Is Bonkers!","Hatchet","Feminist Ryan Gosling: Feminist Theory (as Imagined) from Your Favorite Sensitive Movie Dude","We Speak No Treason I: The Flowering of the Rose (We Speak No Treason S.)","The Little Engine That Could (Original Classic Edition)","Unperfect Souls (Connor Grey, Book 4)","Allhallow's Eve","Raising Self-Reliant Children in a Self-Indulgent World: Seven Building Blocks for Developing Capable Young People","Fudge-a-Mania","The Handmaiden's Necklace (The Necklace Trilogy)","The Summer Retreat (A Moonlight Harbor Novel)"]